apache/nuttx/arch/renesas/src/rx65n/rx65n_definitions.h
/* Register Bit-Field Definitions */

/* MAC Registers */

#define ETH_ECSR_LCHNG     (1 << 2)     /* Bit 2: Link Signal Change Flag */

/* Bit 2: LINK Signal Change Interrupt enable/disable */

#define ETH_ECSIPR_LCHNGIP (1 << 2)
#define ETH_ECMR_CLR       (0x00000000)

/* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */

#define ETH_ECSR_CLR       (0x00000037)
#define ETH_ECMR_RE        (1 << 6) /* Transmit function is enabled */
#define ETH_ECMR_TE        (1 << 5) /* Receive function is enabled */
#define ETH_ECMR_DM        (1 << 1) /* Duplex Mode */
#define ETH_ECMR_RTM       (1 << 2) /* Bit Rate */

/* Bit 4:0:Interpacket Gap 96 bit time (initial value) */

#define ETH_IPGR_IPG_INITIAL     (0x00000014)

/* Receive Frame Maximum Length */

#define ETH_RFLR_RFL             (1518)

/* EDMA Registers */

/* Bit 22: ETHERC status interrupt request is enable/disabled. */

#define ETHD_EDMR_SWR            (1 << 0)

/* Bit 6: Big Endian Mode/Little Endian Mode */

#define ETHD_EDMR_DE             (1 << 6)

/* Clear all EDMAC status bits */

#define ETHD_EESR_EDMAC          (0x47ff0f9f)

/* Frame transfer Complete status Flag check */

#define ETHD_EESR_TC         (1 << 21)

/* ETHERC/EDMAC Status Register Source Flag */

#define ETHD_EESR_ECI        (1 << 22)
#define ETHD_EESR_FR         (1 << 18)   /* Frame Receive Flag */

/* Frame Receive Interrupt Request Enable */

#define ETHD_EESIPR_FRIP     (1 << 18)

/* Frame Transfer Complete Interrupt Request Enable */

#define ETHD_EESIPR_TCIP     (1 << 21)

/* ETHERC/EDMAC Status Register Source Interrupt Request Enable */

#define ETHD_EESIPR_ECIIP    (1 << 22)

/* ETHERC/EDMAC Write-Back Complete Interrupt Request Enable */

#define ETHD_EESIPR_TWBIP    (1 << 30)

/* Bit 0:10: Transmit FIFO Threshold */

#define ETHD_TFTR_TFT        (0x00000000)

/* Bit: 20: Transmit Descriptor Empty Flag */

#define ETHD_EESR_TDE        (1<20)

/* Ether PSR register */

#define ETH_PSR_LMON         (1)

/* End Ethernet and EDMAC Interface */

/* General Values LED: */

#if defined(CONFIG_ARCH_BOARD_RX65N_RSK1MB) || defined(CONFIG_ARCH_BOARD_RX65N_RSK2MB)
#  define LED_ON          (0)
#  define LED_OFF         (1)
#elif defined(CONFIG_ARCH_BOARD_RX65N_GRROSE)
#  define LED_ON          (1)
#  define LED_OFF         (0)
#else
#  error "No Selection for PORT definition in rx65n_port.c"
#endif

/* Bit Set Values */

#define SET_BIT_HIGH    (1)
#define SET_BIT_LOW     (0)
#define SET_BYTE_HIGH   (0xff)
#define SET_BYTE_LOW    (0x00)

/* RTC Register Offsets */

#define RX65N_RTC_R64CNT_OFFSET    (0x0000)
#define RX65N_RTC_RSECCNT_OFFSET   (0x0002)
#define RX65N_RTC_RMINCNT_OFFSET   (0x0004)
#define RX65N_RTC_RHRCNT_OFFSET    (0x0006)
#define RX65N_RTC_RWKCNT_OFFSET    (0x0008)
#define RX65N_RTC_RDAYCNT_OFFSET   (0x000a)
#define RX65N_RTC_RMONCNT_OFFSET   (0x000c)
#define RX65N_RTC_RYRCNT_OFFSET    (0x000e)
#define RX65N_RTC_RSECAR_OFFSET    (0x0010)
#define RX65N_RTC_RMINAR_OFFSET    (0x0012)
#define RX65N_RTC_RHRAR_OFFSET     (0x0014)
#define RX65N_RTC_RWKAR_OFFSET     (0x0016)
#define RX65N_RTC_RDAYAR_OFFSET    (0x0018)
#define RX65N_RTC_RMONAR_OFFSET    (0x001a)
#define RX65N_RTC_RYRAR_OFFSET     (0x001c)
#define RX65N_RTC_RYRAREN_OFFSET   (0x001e)
#define RX65N_RTC_RCR1_OFFSET      (0x0022)
#define RX65N_RTC_RCR2_OFFSET      (0x0024)
#define RX65N_RTC_RCR3_OFFSET      (0x0026)
#define RX65N_RTC_RCR4_OFFSET      (0x0028)
#define RX65N_RTC_RADJ_OFFSET      (0x002e)

#define RX65N_RTC_BASE      (0x0008c400)
#define RX65N_RTC_R64CNT    (RX65N_RTC_BASE + RX65N_RTC_R64CNT_OFFSET)
#define RX65N_RTC_RSECCNT   (RX65N_RTC_BASE + RX65N_RTC_RSECCNT_OFFSET)
#define RX65N_RTC_RMINCNT   (RX65N_RTC_BASE + RX65N_RTC_RMINCNT_OFFSET)
#define RX65N_RTC_RHRCNT    (RX65N_RTC_BASE + RX65N_RTC_RHRCNT_OFFSET)
#define RX65N_RTC_RWKCNT    (RX65N_RTC_BASE + RX65N_RTC_RWKCNT_OFFSET)
#define RX65N_RTC_RDAYCNT   (RX65N_RTC_BASE + RX65N_RTC_RDAYCNT_OFFSET)
#define RX65N_RTC_RMONCNT   (RX65N_RTC_BASE + RX65N_RTC_RMONCNT_OFFSET)
#define RX65N_RTC_RYRCNT    (RX65N_RTC_BASE + RX65N_RTC_RYRCNT_OFFSET)
#define RX65N_RTC_RSECAR    (RX65N_RTC_BASE + RX65N_RTC_RSECAR_OFFSET)
#define RX65N_RTC_RMINAR    (RX65N_RTC_BASE + RX65N_RTC_RMINAR_OFFSET)
#define RX65N_RTC_RHRAR     (RX65N_RTC_BASE + RX65N_RTC_RHRAR_OFFSET)
#define RX65N_RTC_RWKAR     (RX65N_RTC_BASE + RX65N_RTC_RWKAR_OFFSET)
#define RX65N_RTC_RDAYAR    (RX65N_RTC_BASE + RX65N_RTC_RDAYAR_OFFSET)
#define RX65N_RTC_RMONAR    (RX65N_RTC_BASE + RX65N_RTC_RMONAR_OFFSET)
#define RX65N_RTC_RYRAR     (RX65N_RTC_BASE + RX65N_RTC_RYRAR_OFFSET)
#define RX65N_RTC_RYRAREN   (RX65N_RTC_BASE + RX65N_RTC_RYRAREN_OFFSET)
#define RX65N_RTC_RCR1      (RX65N_RTC_BASE + RX65N_RTC_RCR1_OFFSET)
#define RX65N_RTC_RCR2      (RX65N_RTC_BASE + RX65N_RTC_RCR2_OFFSET)
#define RX65N_RTC_RCR3      (RX65N_RTC_BASE + RX65N_RTC_RCR3_OFFSET)
#define RX65N_RTC_RCR4      (RX65N_RTC_BASE + RX65N_RTC_RCR4_OFFSET)
#define RX65N_RTC_RADJ      (RX65N_RTC_BASE + RX65N_RTC_RADJ_OFFSET)

#define RTC_RTC_ALRDIS    (0x00)
#define RTC_RCR4_RCKSEL   (0x00)
#define RTC_RCR3_RTCEN    (0x01)
#define RTC_RCR3_RTCDV    (0x02)
#define RTC_RCR2_START    (0x01)
#define RTC_RCR2_CNTMD    (0x00)
#define RTC_RCR2_RESET    (0x01)
#define RTC_ALARM_INT_ENABLE (0x01)
#define RTC_CARRY_INT_ENABLE (0x02)
#define RTC_PERIOD_INT_ENABLE (0x04)
#define RTC_PERIODIC_INT_PERIOD_1 (0xe0)
#define _04_FOUR_READ_COUNT (0x04)
#define RTC_1_64_SEC_CYCLE (0x0005b8d9)
#define _0F_RTC_PRIORITY_LEVEL15 (0x0f)
#define  RTC_RCR1_CUP            (0x02)
#define RX65N_SUBCLKOSC_SOSCCR  (0x00080033)
#define SUBCLKOSC_SOSCCR_SOSTP  (0x01)
#define RX65N_SUBCLKOSC_SOSCWTCR (0x0008c293)
#define RTC_SOSCWTCR_VALUE      (0x21)
#define RTC_DUMMY_READ          (3)
#define _00_RTC_PRIORITY_LEVEL0 (0)
#define _04_RTC_PERIOD_INT_ENABLE  (0x04)
#define RTC_RTC_CARRYDIS     (0xe5)
#define RTC_RTC_PERDIS       (0xe3)
#define RTC_RADJ_INITVALUE   (0x0)
#define RTC_RCR2_AADJE       (0x10)
#define RTC_RCR2_AADJP       (0x20)

#if defined(CONFIG_RTC) || defined(CONFIG_RTC_DRIVER)

#define HAVE_RTC_DRIVER       1

#endif

#define RX65N_RTC_WAIT_PERIOD 184
#define RTC_RCR2_HR24         (0x40)
#define RTC_PERIODIC_INTERRUPT_2_SEC (0xf)

/****************************************************************************
 * Public Types
 ***************************************************************************/

/****************************************************************************
 * Public Data
 ***************************************************************************/

#ifndef __ASSEMBLER__
/* Serial Communications interface (SCI) */

enum   E_RX_SCI
{
  RX_SCI_SMR_OFFSET = 0,
  RX_SCI_BRR_OFFSET,
  RX_SCI_SCR_OFFSET,
  RX_SCI_TDR_OFFSET,
  RX_SCI_SSR_OFFSET,
  RX_SCI_RDR_OFFSET,
  RX_SCI_SCMR_OFFSET,
  RX_SCI_SEMR_OFFSET,
  RX_SCI_SNFR_OFFSET,
  RX_SCI_SIMR1_OFFSET,
  RX_SCI_SIMR2_OFFSET,
  RX_SCI_SIMR3_OFFSET,
  RX_SCI_SISR_OFFSET,
  RX_SCI_SPMR_OFFSET,
  RX_SCI_THRHL_OFFSET,
  RX_SCI_RDRHL_OFFSET,
  RX_SCI_MDDR_OFFSET
};
#endif /* __ASSEMBLER__ */

#endif /* __ARCH_RENESAS_SRC_RX65N_RX65N_DEFINITIONS_H */
